       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 USER-NAME PIC A(20).
       PROCEDURE DIVISION.
           DISPLAY "ENTER YOUR NAME: ".
           ACCEPT USER-NAME.
           DISPLAY "HELLO, " USER-NAME "!".
           STOP RUN.
